/* No comment provided by engineer. */
"An invalid attribute type was provided." = "An invalid attribute type was provided.";

/* No comment provided by engineer. */
"An invalid record type was provided." = "An invalid record type was provided.";

/* No comment provided by engineer. */
"An invalid search type was provided during the query." = "An invalid search type was provided during the query.";

/* No comment provided by engineer. */
"Authentication server could not be contacted." = "Authentication server could not be contacted.";

/* No comment provided by engineer. */
"Authentication server could not be found for the requested operation." = "Authentication server could not be found for the requested operation.";

/* No comment provided by engineer. */
"Authentication server encountered a communication error while attempting the requested operation." = "Authentication server encountered a communication error while attempting the requested operation.";

/* No comment provided by engineer. */
"Authentication server encountered an error while attempting the requested operation." = "Authentication server encountered an error while attempting the requested operation.";

/* No comment provided by engineer. */
"Authentication server failed to complete the requested operation." = "Authentication server failed to complete the requested operation.";

/* No comment provided by engineer. */
"Authentication server refused operation because the current credentials are not authorized for the requested operation." = "Authentication server refused operation because the current credentials are not authorized for the requested operation.";

/* No comment provided by engineer. */
"Authentication server refused the operation because it wasn't the master." = "Authentication server refused the operation because it wasn't the master.";

/* No comment provided by engineer. */
"Authentication server timed out while attempting the requested operation." = "Authentication server timed out while attempting the requested operation.";

/* No comment provided by engineer. */
"Connection failed to the directory server." = "Connection failed to the directory server.";

/* No comment provided by engineer. */
"Could not create the record because one already exists with the same name." = "Could not create the record because one already exists with the same name.";

/* No comment provided by engineer. */
"Could not resolve the address." = "Could not resolve the address.";

/* No comment provided by engineer. */
"Could not verify credentials because directory server does not support the requested authentication method." = "Could not verify credentials because directory server does not support the requested authentication method.";

/* No comment provided by engineer. */
"Credential operation failed because an invalid parameter was provided." = "Credential operation failed because an invalid parameter was provided.";

/* No comment provided by engineer. */
"Credential server can't recover password for verification." = "Credential server can't recover password for verification.";

/* No comment provided by engineer. */
"Credential verification failed because account is disabled." = "Credential verification failed because account is disabled.";

/* No comment provided by engineer. */
"Credential verification failed because account is expired." = "Credential verification failed because account is expired.";

/* No comment provided by engineer. */
"Credential verification failed because account is inactive." = "Credential verification failed because account is inactive.";

/* No comment provided by engineer. */
"Credential verification failed because password has expired." = "Credential verification failed because password has expired.";

/* No comment provided by engineer. */
"Credentials could not be verified, username or password is invalid." = "Credentials could not be verified, username or password is invalid.";

/* No comment provided by engineer. */
"Credentials failed because authentication server could not find the account." = "Credentials failed because authentication server could not find the account.";

/* No comment provided by engineer. */
"Node name wasn't found." = "Node name wasn't found.";

/* No comment provided by engineer. */
"Not allowed to log into the computer outside of designated hours." = "Not allowed to log into the computer outside of designated hours.";

/* No comment provided by engineer. */
"Not allowed to log into the computer." = "Not allowed to log into the computer.";

/* No comment provided by engineer. */
"One of the parameters provided was invalid." = "One of the parameters provided was invalid.";

/* No comment provided by engineer. */
"Operation is not supported by the directory node." = "Operation is not supported by the directory node.";

/* No comment provided by engineer. */
"Operation was denied because the current credentials do not have the appropriate privileges." = "Operation was denied because the current credentials do not have the appropriate privileges.";

/* No comment provided by engineer. */
"Password change failed because password does not meet minimum quality requirements." = "Password change failed because password does not meet minimum quality requirements.";

/* No comment provided by engineer. */
"Password change failed because password is too long." = "Password change failed because password is too long.";

/* No comment provided by engineer. */
"Password change failed because password is too short." = "Password change failed because password is too short.";

/* No comment provided by engineer. */
"Password change failed because password requires a letter." = "Password change failed because password requires a letter.";

/* No comment provided by engineer. */
"Password change failed because password requires a number." = "Password change failed because password requires a number.";

/* No comment provided by engineer. */
"Password change failed because password was changed recently." = "Password change failed because password was changed recently.";

/* No comment provided by engineer. */
"Password change is required by authentication server." = "Password change is required by authentication server.";

/* No comment provided by engineer. */
"Previous results are no longer valid because a synchronize call was requested." = "Previous results are no longer valid because a synchronize call was requested.";

/* No comment provided by engineer. */
"Proxy failed because an unknown host was provided." = "Proxy failed because an unknown host was provided.";

/* No comment provided by engineer. */
"Proxy failed because the host provided is not responding." = "Proxy failed because the host provided is not responding.";

/* No comment provided by engineer. */
"Proxy failed because the version is not supported by this client." = "Proxy failed because the version is not supported by this client.";

/* No comment provided by engineer. */
"Proxy failed due to a communication error." = "Proxy failed due to a communication error.";

/* No comment provided by engineer. */
"Session can't be opened because daemon is not running." = "Session can't be opened because daemon is not running.";

/* No comment provided by engineer. */
"Session can't be opened because daemon refused the connection." = "Session can't be opened because daemon refused the connection.";

/* No comment provided by engineer. */
"Session can't be opened to local only daemon because normal daemon references are open." = "Session can't be opened to local only daemon because normal daemon references are open.";

/* No comment provided by engineer. */
"Session can't be opened to normal daemon because local only references are open." = "Session can't be opened to normal daemon because local only references are open.";

/* No comment provided by engineer. */
"That type of search is not supported by the directory node." = "That type of search is not supported by the directory node.";

/* No comment provided by engineer. */
"The attribute value could not be used because it does not meet the requirements of the attribute." = "The attribute value could not be used because it does not meet the requirements of the attribute.";

/* No comment provided by engineer. */
"The daemon encountered an error processing request." = "The daemon encountered an error processing request.";

/* No comment provided by engineer. */
"The plugin encountered an error processing request." = "The plugin encountered an error processing request.";

/* No comment provided by engineer. */
"The query exceeded the maximum time allowed." = "The query exceeded the maximum time allowed.";

/* No comment provided by engineer. */
"The record type provided is not allowed by the node." = "The record type provided is not allowed by the node.";

/* No comment provided by engineer. */
"The requested attribute could not be found." = "The requested attribute could not be found.";

/* No comment provided by engineer. */
"The requested attribute value could not be found." = "The requested attribute value could not be found.";

/* No comment provided by engineer. */
"Unable to modify record because the directory node is read only." = "Unable to modify record because the directory node is read only.";

/* No comment provided by engineer. */
"Unable to open node type requested." = "Unable to open node type requested.";

/* No comment provided by engineer. */
"Unknown error code." = "Unknown error code.";

